import { Title } from '~shared/ui/title';

export function AboutPage() {
  return (
    <div className="bg-gray-50 min-h-screen">
      <div className="container mx-auto px-4 py-10">
        <Title>О нас</Title>В условиях стремительного роста сферы досуга и
        развлечений в Бишкеке всё больше людей сталкиваются с необходимостью
        оперативного и удобного поиска информации о местах для отдыха.
        Современные пользователи ценят время, предпочитая получать достоверную,
        актуальную и визуально оформленную информацию в одном ресурсе. Именно
        такую задачу и решает наш веб-сайт — информационная система,
        разработанная для того, чтобы каждый человек мог легко ориентироваться в
        разнообразии досуговых предложений столицы. Платформа представляет собой
        полнофункциональный веб-ресурс, который предоставляет сведения о кафе,
        ресторанах, парках, кинотеатрах, галереях, развлекательных центрах,
        выставках, ярмарках и других интересных местах. Все объекты представлены
        с подробным описанием, высококачественными фотографиями, рейтингами и
        отзывами пользователей, что позволяет формировать объективную оценку
        перед посещением. Кроме того, на сайте реализована интеграция с
        интерактивными картами, благодаря чему можно быстро определить
        расположение объекта и спланировать маршрут. Интерфейс адаптирован под
        все устройства, от смартфонов до ноутбуков, обеспечивая удобную
        навигацию и доступ к информации в любом месте и в любое время. Платформа
        предлагает как пользовательский, так и административный функционал:
        зарегистрированные пользователи могут оставлять отзывы и оценки, а
        администраторы — оперативно обновлять данные, добавлять новые объекты,
        управлять комментариями и модерировать контент, что обеспечивает высокое
        качество и актуальность информации. Таким образом, сайт становится не
        просто справочным источником, а живым пространством, формируемым
        совместными усилиями пользователей и разработчиков. Наша цель —
        способствовать культурному и социальному развитию города, повышать
        доступность информации и делать досуг в Бишкеке более организованным,
        качественным и интересным для каждого.
      </div>
    </div>
  );
}
